{"class_name": "Model", "config": {"name": "model_4", "layers": [{"name": "encoder_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 300], "dtype": "float32", "sparse": false, "name": "encoder_input"}, "inbound_nodes": []}, {"name": "embedding_layer", "class_name": "Embedding", "config": {"name": "embedding_layer", "trainable": false, "batch_input_shape": [null, 300], "dtype": "float32", "input_dim": 51320, "output_dim": 200, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 300}, "inbound_nodes": [[["encoder_input", 0, 0, {}]]]}, {"name": "encoder_layer1", "class_name": "Bidirectional", "config": {"name": "encoder_layer1", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 100, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.5, "implementation": 1}}, "merge_mode": "sum"}, "inbound_nodes": [[["embedding_layer", 0, 0, {}]]]}, {"name": "encoder_layer2", "class_name": "Bidirectional", "config": {"name": "encoder_layer2", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_2", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 50, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.5, "implementation": 1}}, "merge_mode": "sum"}, "inbound_nodes": [[["encoder_layer1", 0, 0, {}]]]}, {"name": "encoder_layer3", "class_name": "Bidirectional", "config": {"name": "encoder_layer3", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_3", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 25, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.5, "implementation": 1}}, "merge_mode": "sum"}, "inbound_nodes": [[["encoder_layer2", 0, 0, {}]]]}, {"name": "latent_mean", "class_name": "Dense", "config": {"name": "latent_mean", "trainable": true, "units": 100, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["encoder_layer3", 0, 0, {}]]]}, {"name": "latent_var", "class_name": "Dense", "config": {"name": "latent_var", "trainable": true, "units": 100, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["encoder_layer3", 0, 0, {}]]]}, {"name": "latent_space", "class_name": "Lambda", "config": {"name": "latent_space", "trainable": true, "function": ["4wEAAAAAAAAABAAAAAUAAAATAAAAczgAAAB8AFwCfQF9AnQAagF8AYMBZAEZAH0DfAF0AGoCfAOI\nAGYCZAKNAXQAagN8AmQDGwCDARQAFwBTACkETukAAAAAKQHaBXNoYXBl6QIAAAApBNoBS3ICAAAA\n2g1yYW5kb21fbm9ybWFs2gNleHApBNoMbWVhbl9hbmRfdmFy2gtsYXRlbnRfbWVhbtoKbGF0ZW50\nX3ZhctoKYmF0Y2hfc2l6ZSkB2gtsYXRlbnRfc2l6ZakA+hthZHZlcnNhcmlhbF9hdXRvZW5jb2Rl\ncjIucHnaCHNhbXBsaW5nqwAAAHMGAAAAAAEIAQ4C\n", null, [100]], "function_type": "lambda", "output_shape": [100], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["latent_mean", 0, 0, {}], ["latent_var", 0, 0, {}]]]}, {"name": "Repeater", "class_name": "RepeatVector", "config": {"name": "Repeater", "trainable": true, "n": 300}, "inbound_nodes": [[["latent_space", 0, 0, {}]]]}, {"name": "decoder_layer1", "class_name": "Bidirectional", "config": {"name": "decoder_layer1", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_4", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 25, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.5, "implementation": 1}}, "merge_mode": "sum"}, "inbound_nodes": [[["Repeater", 0, 0, {}]]]}, {"name": "decoder_layer2", "class_name": "Bidirectional", "config": {"name": "decoder_layer2", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_5", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 50, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.5, "implementation": 1}}, "merge_mode": "sum"}, "inbound_nodes": [[["decoder_layer1", 0, 0, {}]]]}, {"name": "decoder_layer3", "class_name": "Bidirectional", "config": {"name": "decoder_layer3", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_6", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 100, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.5, "implementation": 1}}, "merge_mode": "sum"}, "inbound_nodes": [[["decoder_layer2", 0, 0, {}]]]}, {"name": "reconstructed_news", "class_name": "Bidirectional", "config": {"name": "reconstructed_news", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_7", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 200, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.5, "implementation": 1}}, "merge_mode": "sum"}, "inbound_nodes": [[["decoder_layer3", 0, 0, {}]]]}, {"name": "model_3", "class_name": "Model", "config": {"name": "model_3", "layers": [{"name": "encoder_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 300], "dtype": "float32", "sparse": false, "name": "encoder_input"}, "inbound_nodes": []}, {"name": "embedding_layer", "class_name": "Embedding", "config": {"name": "embedding_layer", "trainable": false, "batch_input_shape": [null, 300], "dtype": "float32", "input_dim": 51320, "output_dim": 200, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 300}, "inbound_nodes": [[["encoder_input", 0, 0, {}]]]}, {"name": "encoder_layer1", "class_name": "Bidirectional", "config": {"name": "encoder_layer1", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 100, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.5, "implementation": 1}}, "merge_mode": "sum"}, "inbound_nodes": [[["embedding_layer", 0, 0, {}]]]}, {"name": "encoder_layer2", "class_name": "Bidirectional", "config": {"name": "encoder_layer2", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_2", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 50, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.5, "implementation": 1}}, "merge_mode": "sum"}, "inbound_nodes": [[["encoder_layer1", 0, 0, {}]]]}, {"name": "encoder_layer3", "class_name": "Bidirectional", "config": {"name": "encoder_layer3", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_3", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 25, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.5, "implementation": 1}}, "merge_mode": "sum"}, "inbound_nodes": [[["encoder_layer2", 0, 0, {}]]]}, {"name": "latent_mean", "class_name": "Dense", "config": {"name": "latent_mean", "trainable": true, "units": 100, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["encoder_layer3", 0, 0, {}]]]}, {"name": "latent_var", "class_name": "Dense", "config": {"name": "latent_var", "trainable": true, "units": 100, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["encoder_layer3", 0, 0, {}]]]}, {"name": "latent_space", "class_name": "Lambda", "config": {"name": "latent_space", "trainable": true, "function": ["4wEAAAAAAAAABAAAAAUAAAATAAAAczgAAAB8AFwCfQF9AnQAagF8AYMBZAEZAH0DfAF0AGoCfAOI\nAGYCZAKNAXQAagN8AmQDGwCDARQAFwBTACkETukAAAAAKQHaBXNoYXBl6QIAAAApBNoBS3ICAAAA\n2g1yYW5kb21fbm9ybWFs2gNleHApBNoMbWVhbl9hbmRfdmFy2gtsYXRlbnRfbWVhbtoKbGF0ZW50\nX3ZhctoKYmF0Y2hfc2l6ZSkB2gtsYXRlbnRfc2l6ZakA+hthZHZlcnNhcmlhbF9hdXRvZW5jb2Rl\ncjIucHnaCHNhbXBsaW5nqwAAAHMGAAAAAAEIAQ4C\n", null, [100]], "function_type": "lambda", "output_shape": [100], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["latent_mean", 0, 0, {}], ["latent_var", 0, 0, {}]]]}, {"name": "discriminator_layer1", "class_name": "Dense", "config": {"name": "discriminator_layer1", "trainable": true, "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["latent_space", 0, 0, {}]]]}, {"name": "leaky_re_lu_1", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_1", "trainable": true, "alpha": 0.30000001192092896}, "inbound_nodes": [[["discriminator_layer1", 0, 0, {}]]]}, {"name": "discriminator_layer2", "class_name": "Dense", "config": {"name": "discriminator_layer2", "trainable": true, "units": 256, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]]}, {"name": "leaky_re_lu_2", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_2", "trainable": true, "alpha": 0.30000001192092896}, "inbound_nodes": [[["discriminator_layer2", 0, 0, {}]]]}, {"name": "discriminator_output", "class_name": "Dense", "config": {"name": "discriminator_output", "trainable": true, "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]]}], "input_layers": [["encoder_input", 0, 0]], "output_layers": [["discriminator_output", 0, 0]]}, "inbound_nodes": [[["latent_space", 0, 0, {}]]]}], "input_layers": [["encoder_input", 0, 0]], "output_layers": [["reconstructed_news", 0, 0], ["model_3", 1, 0]]}, "keras_version": "2.2.0", "backend": "tensorflow"}